{"meta":{"title":"Muqing's Blog","subtitle":"","description":"来自闲暇时候的叨叨","author":"Muqing Liu","url":"http://clicliff.github.io","root":"/"},"pages":[{"title":"","date":"2022-11-19T08:35:09.008Z","updated":"2022-11-19T08:35:09.008Z","comments":true,"path":"about/index.html","permalink":"http://clicliff.github.io/about/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2022-11-19T08:34:40.436Z","updated":"2022-11-19T08:34:40.436Z","comments":true,"path":"tags/index.html","permalink":"http://clicliff.github.io/tags/index.html","excerpt":"","text":""},{"title":"所有分类","date":"2022-11-19T08:32:24.055Z","updated":"2022-11-19T08:32:24.055Z","comments":true,"path":"categories/index.html","permalink":"http://clicliff.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"夜谈3","slug":"夜谈3","date":"2022-11-25T14:41:06.000Z","updated":"2022-11-25T16:45:26.142Z","comments":true,"path":"2022/11/25/夜谈3/","link":"","permalink":"http://clicliff.github.io/2022/11/25/%E5%A4%9C%E8%B0%883/","excerpt":"","text":"我时常觉得自己有些淡漠。不是指如同武侠小说中的大侠一般，潇洒看着人间一切，这里的淡漠绝非是我所认为的人类美德，而是一种共情的缺失，我极度担心这其实是一种麻木的开始，到最后会成为自私的一份子。 每晚洗完澡总要吹头发，我两侧的头发由于无法出去，早已长得不成样子，我不知为什么看向镜子里的自己：阳台顶上的灯被舍友晾起的衣服遮挡，我的脸上看到阴影，主要分布在两个坑中——我的眼睛；眼白之中有个黑黢黢的圆圈——我的虹膜；虹膜之中有个深不见底的黑洞——我的瞳孔。（从迷信的角度）我坚信我的灵魂藏身于此处，所以我奋力注视，将视线的焦点定格在其中，妄图探索到自己，以自己的视角审视自己。 我觉得我失败了。我看到的只有空洞，没有自己认为的那般，可能会有生命力、夹杂着一点点思考、或许不太丰富的情感、抑或是美好与不美好的记忆。我看到瞳孔如同黑洞般旋转，只不过吸走的不是妄图逃逸的光线，而是我的思绪。 那我看向别人的瞳孔会发生什么？我能否透过窗户看到他或她的灵魂？或许这是一面镜子会反射出我自己？ 思绪继续被黑洞吸积。 我从狗的瞳孔中看出憨憨与信任（大多时候看的是我家钢镚儿），猫的瞳孔中看到懵逼中夹杂一丝狡黠（我姐家的肥肠和学校里的猫），我在湖里鱼的眼睛中（离得太远很难看到瞳孔）只看到他们没有思考地游向食物。但一旦看向人，便大不相同，我很难去总结出什么，但我可以肯定的说，能看到他的性格（起码是我认为他的性格）。我其实从未直接看到别人完整的灵魂。穿过他人的瞳孔，我看到的是我与他的灵魂相交集的部分，甚至无所谓被注视着的他是否有“生命”的存在。 为了避免被他人审视，伪装与谎言由此诞生。 我常想有没有一个物种不存在交流的谎言。他们通过某种方式（比如触碰），可以获悉对方的情感与内心，这样谎言无所遁形，也便没有了存在的意义。不小心接触到尸体也会体会到他生前的记忆，死亡时的感受，或许是被烈焰灼烧的皮肤、被海水灌满的肺部、从高处坠落与坚硬地面接触的骨头。肉体的感知恐怖如斯，心理的感受在我看来或许更加残忍。这个物种要么变得多愁善感、要么变得封闭自己、要么变得冷漠麻木。 我逐渐无法相信离我有些距离的一切，尤其是网络传播的信息。面对来势汹汹的雪崩，我决不敢轻易相信任何一片雪花。我忽然发现我的淡漠是有原因的。我无法在群情激愤时慷慨、无法在大众的悲伤面前落泪。我喜欢傻笑，因为傻笑是一种不具有敌意的，但却可以让别人不去在意你的最好方式。我想与很多人和事保持一些距离，不让自己陷入当事的漩涡，而是站在一个飘在空中的人的角度去观看。 我不觉得这是一种麻木。 我觉得需要去记录一些东西，是我那些不带有色彩的黑白照片。时间会冲刷一切，“重点”会保留下来，钢笔不在我的手中，我只拥有我的眼睛。色彩会带走观众的注意力，容易褪去容易出现纰漏。周遭的光线越明亮会变得越复杂，我感觉自己身处其中却无法辨别每一道光线入射的方向。混乱、无序是每一个系统的归宿，但我坚信可以理出来些什么，蛛丝马迹会汇聚在同一个交点处。 我希望我是个旁观者。","categories":[],"tags":[{"name":"夜谈","slug":"夜谈","permalink":"http://clicliff.github.io/tags/%E5%A4%9C%E8%B0%88/"}]},{"title":"重庆","slug":"重庆","date":"2022-10-07T13:02:53.000Z","updated":"2022-11-25T14:33:33.235Z","comments":true,"path":"2022/10/07/重庆/","link":"","permalink":"http://clicliff.github.io/2022/10/07/%E9%87%8D%E5%BA%86/","excerpt":"","text":"​ 今日带着 Ricoh XR-X2000 去渝中区逛了一遭，14 度的下雨天气，照理来说不算很低，出门时觉得凉爽，归程时却觉得有些寒意。我已不记得去年重庆的冬了，就连去年的夏日也是，像隔着一层如今天在山城步道上远眺高楼时横在之间的雾：楼的形状当然是确定的，也可以看到玻璃外表的通亮，却琢磨不出细致的外貌来。我更加坚定用我的相机记录一些事情的想法，最好还是用胶卷，blog 的随笔记录也照例吧！不足 365 日我却无法看清过去，想到我才 19 岁 364 天（没错，明天是我的生日），不知还要生活多少个春秋，我决不能让我的记忆如同一些学过的知识一般被淡忘。如果说被遗忘是死亡的开始，我的很多旧时光已经逝去，那我尽量不要让现在也消失在未来的回忆里吧。 ​ 我回忆起我对一些城市的感觉。西安是那个去看鼻炎的秋天，凌晨到达之后母亲带着我去一个二楼既是网吧也是酒店的地方开了个钟点房，前台的那个小伙子睡得死沉，无论是开房间时还是退房间时，都花了不少力气来叫醒他，我觉得非常的漫长，这个画面现在在我脑子里也是慢镜头的放映。之后我们去交大二附院对面的小六汤包吃早点，不得不说我很喜欢带馅儿的食物，去了发现可能很多人都这样：门口在排队，而且需要拼桌。我们和一对中年夫妻坐在了一桌，中年女人用带着口音的普通话尝试和母亲攀谈（现在回想起来，大概是河南口音），我的母亲同样也用带着陕北口音（鼻音）的普通话进行回应。“这粥里的米粒儿是生的。”那个女人用一种仿佛发现了什么罪恶般的语气轻声说道。我听到了，但没有发表意见，我依旧喝完了那碗蛮甜的南瓜粥。这个女人的话在我脑子里存留了许久，我每到西安总会听到起这个声音。西安对我而言是一粒夹生的米。 ​ 上海是我在黄浦江上的游轮吹着晚风，我的耳机里放着挪威民谣组合 Kings of Convenience 的 Mrs. Cold，我爸在我对面说他喝啤酒很爽，脸上浮现出略微浮夸的表情，并且用“生动”的声音诠释；我妈在旁边对我喋喋不休，说你应该好好看风景而不是出来也戴着耳机。那一刻我对他们的不满达到了极点，我也很惊讶为什么会有此种感觉，他们其实是开明的父母，也并没有对我进行过度的干涉。思考后我发现了问题所在，就是每个人总是希望将自己的意志或多或少的加在旁人的身上，我也是如此，而我又是一个有很强自我的人，我绝不会让别人影响到我的节奏，这大概是原因吧。我理解出现这种感觉是正常的，而且我将来会尽量的让我的孩子保持着他自己的意志，不去刻意将一些我独有的特性强加与他。他会是一个具有自己独特品质，无拘无束，不去被一些固有条框所拘禁，可以在兼顾理想的同时做到脚踏实地的人。这是我对自己的期望，同样也是对他的。那天晚上我第一次想到未来要怎样，在此之前我一直向往沿海都市，但之后我改变了想法，因为在那个节奏剧烈的地方，机会虽然与风险并存，但空气中充斥着一股压力，在地铁里尤为明显，这不是当时、现在、一段时间未来的我所能承受的，我不要去那样快速的地方，我需要慢下来。我需要思考，需要找到我自己的规律，繁忙的都市不是我的去处。上海对我而言是黄浦江面的月亮，是那位 Mrs.Cold。 ​ 我来到了重庆，一个充满巧合的地方，来到这里（特别是重大）让我觉得好像一切事情在冥冥之中都有注定。我有1000个机会错过，但还是来到了这里。初来的不适应让我觉得这个地方处处与我作对，而重庆和重大都给了我第二次机会，我也把握住了这个机会，起码现在看来是如此。重庆其实是两个城市——夏和秋冬，就像是白日与黑夜，夏日的重庆是网络上人人都可以查到的，每一篇文章其实都没有说错。但秋冬就是另一面的黑夜，整日充斥着阴雨与灰色的雾，今日前往渝中区玩耍，透过轻轨的玻璃，我看到一个黄绿色的世界，这种极具特点的颜色让我想到了黄土高原的沙尘暴，我惊讶两江交汇的重庆也会出现这样的颜色。我从较场口下车，吃碗面后踏上山城步道，我并没有按着路牌一直前进，从领事馆旧址开始，我开始在老旧的小区间穿梭。那里的气味也很熟悉，就像是外婆在毛纺厂老房子的院子——下雨后有一股下水道的味道，金属的防盗窗锈迹斑斑，墙皮如鱼鳞般脱落，又像是少女的唇随着年龄增长变得布满褶皱，且原本欲滴的红色也暗淡下来，一栋楼里可能只有一两个阳台还在挂着晾晒（很难被晒）的衣服，我只见到一些老人在搓着麻将，拉着小车。从长江走到嘉陵江，清澈的江水变成了浑浊的黄色，有一个很长的台阶连接着山上和山下的路，但走上去才发现原本相通的住宅区大门锁住了，还贴着“监控全覆盖”的告示，我沿着原路返回，几乎没有人住着的一栋楼里走出一个老头，迈着不算矫健但也不算僵硬的步子向台阶下走去，那一刻我忽然嗅到了空气中的一些东西，或许是一些愁思。我不知道这愁思从何而来，因为我并未在这里生活太久，大学城充斥着朝气，老城给我一种脚踏实地的感觉，我觉得这个城市是有根的，根扎在了江底很深的地方，这是一个城市的底蕴，但也是难以被改变，不能迅速追上时代的缺点。我好像找到了一点愁思来源的根据，或许是上个世纪末和这个世纪初，转型的未知；也或许是面对未来的迷茫，但归根结底，我在那天的黄绿色调里，看到了一个不太一样的重庆。 ​ 祝我自己生日快乐。 最后附上一些选出来的胶卷相片","categories":[],"tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://clicliff.github.io/tags/%E6%9D%82%E8%B0%88/"}]},{"title":"夜谈2","slug":"夜谈2","date":"2022-10-02T12:34:50.000Z","updated":"2022-11-25T14:33:39.229Z","comments":true,"path":"2022/10/02/夜谈2/","link":"","permalink":"http://clicliff.github.io/2022/10/02/%E5%A4%9C%E8%B0%882/","excerpt":"","text":"今天想谈谈死亡。 万事有因果，有轮环。一年有春夏秋冬，一日有黑夜白昼，出生和死亡是生命的日夜和春秋。其实对死亡，观念是逐渐开放的，至少在我身边，还未曾出现过因为离世而要死要活的场景，死亡是一种闹腾的沉默，有悲歌哀乐、吹拉弹唱、亲朋好友。年纪越大的喜丧更像是一种炫耀，是死者面对活着的后辈的一种炫耀：又孝顺的子女，心平气和在这世上良久，死后也可以走的体面。不知道院子里的其他老头老太会不会羡慕，给孩子叮咛：“我死后也要怎么怎么样。”然后再发表一通对于生命的高深见解，对于自己这一辈子活到这个时候够本了的大气慷慨，无不体现出一种自己对于死亡的直面与勇气，豁达与乐观。葬礼上沉默的是那个躺着的人，很遗憾他已经失去了坐起来发表见解的能力。葬礼上沉默的是有关于躺着的人的事，我见到宽慰生者，醉酒发泄，人生感悟，指挥吆喝，唯独没有见到除了那一页祭文外而存在的那个人。死亡定格了那个人在大家都在的场合大声被提到的资格，取而代之的是小团体中的窃窃私语，他成为了一个例子，活在话语中的例子。活在记忆中的他不会被提及，直到脑中将记忆消化，才会从嘴里吐出来。 死亡无论会不会被提及，人在其面前总是软弱的。我还从未见过一个人，真真正正的，将死亡可以当成一件如同早上起来要上厕所般稀松平常的事情。无论他表现得多么洒脱，我在其眼中总能看到一种对未知的 疑惑 或者是 恐惧。平原上的马在奔跑时不介意踩入小溪，但对于河流，总是慎重考虑的。死亡是一条未知的渡河，我见到逝去的人乘着木船摆往对岸，从踏入河流起，不再对身后岸上的呼喊做出回应，每条船上只有一个乘客，无所谓是刚出生的婴儿还是佝偻的老者，他们孤独地站在前艄高高翘起的渡船上，只露出后脑勺和渐渐消失在薄雾中的背影，船艄挂着一盏从烛火（古代应该是这样）换成节能LED的灯（地府大概也是要绿色能源的），将雾照亮成惨白的颜色，船并不由乘客划动，只是自顾自顺着流向蜿蜒飘荡。 我期待死亡。夹杂着恐惧的期待。我害怕死亡是一件充满疼痛的事情，像一双手从我的胸膛伸出，我试着大喊但肺部的气体消失不见，我的声带僵硬无法震动；我的瞳孔放大，灯光在我的视网膜涣散，视线从最中心开始变黑，黑色的圆慢慢像四周扩散；声音由清晰变木，像脑袋被大钟罩住，模糊的振动充斥着我的腔体。我的死亡会对我亲近的人带来疼痛，但我早已无暇顾及。我期待的死亡是一种平静，一种极致的平静，从脑中的各种声音里解脱，从有意识的实体变为无意识的虚无，这对我而言是一种诱惑。 为了有勇气面对未知的死亡，人类每天夜里生命都要入睡。睡眠是短暂的死亡。","categories":[],"tags":[{"name":"夜谈","slug":"夜谈","permalink":"http://clicliff.github.io/tags/%E5%A4%9C%E8%B0%88/"}]},{"title":"夜谈","slug":"夜谈","date":"2022-09-27T14:45:20.000Z","updated":"2022-11-25T14:33:15.689Z","comments":true,"path":"2022/09/27/夜谈/","link":"","permalink":"http://clicliff.github.io/2022/09/27/%E5%A4%9C%E8%B0%88/","excerpt":"","text":"很想瘫在椅子上，或者是和床融为一体。很多个晚上都是这样的，尤其是白天越“充实”。在图书馆待得越久，好像回去之后愈有一种说不出的空虚：像深夜微波的湖面、秋雨带风的树林。倒也不存在多么强烈，只是犹如生长痛一般，活动时无暇顾及，躺倒后却像头发丝快速在小腿骨中生长。 很难去想清楚这种感觉到底是从哪儿来的，或许是没有过一段亲密关系？但仔细想也非此原因，开启一段关系很容易，但一个人不像是一本书，在你空闲时间翻开看看，无论是精读粗略，在繁忙时便放在一旁，这可以，但对我而言不可能，我怎可能将己之不欲施之于人？细想来，其实是我一直没有准备好，没有准备好让一个可能的人进入我的生活，我的事情太多，而我又太过贪婪，并不想舍弃原有的时间，也就不可能将切好的蛋糕再分一块出来。或许，还是没有遇到我心底里认为这样值得的人吧。 但这又是一种危险的感觉。饥饿的野兽更容易调入猎人的陷阱，盲目增加自己的事情并不能增多自己的收获反而会更累，最终乐此不疲，搞不清楚在哪一天会变成没有自我，只为了所谓满足感而做事的瘾君子。我绝不能这样。 机器日日不停，不知他们在夜晚无人的车间里会想些什么。我相信绝不是攀比今日谁的工作量更大，但更有可能是批判今日的工人如昨日一般重手重脚，“好像我没有感觉似的”。 我真的很想变成一朵云，在有风的日子里可以随处飘荡，无风的日子便稍事休息；心情愉悦就挡住身后灼热的太阳，难过则痛快下一场雨，淹得城市下水系统瘫痪，让地下的“芝麻点”同我一块儿悲伤；碰到另一朵云见她嫣然一笑，就长出一道彩虹向她送去，也不管她接不接受，总之地上会有人看到，并且指着这里与别人分享。","categories":[],"tags":[{"name":"夜谈","slug":"夜谈","permalink":"http://clicliff.github.io/tags/%E5%A4%9C%E8%B0%88/"}]},{"title":"有关于摄影","slug":"我所理解的摄影","date":"2022-09-22T01:41:26.000Z","updated":"2022-11-25T14:33:22.641Z","comments":true,"path":"2022/09/22/我所理解的摄影/","link":"","permalink":"http://clicliff.github.io/2022/09/22/%E6%88%91%E6%89%80%E7%90%86%E8%A7%A3%E7%9A%84%E6%91%84%E5%BD%B1/","excerpt":"","text":"现在是 2022.9.22 的上午 9：43 ，距离周四上午的量子力学还有 50 分钟。在意识到呆在宿舍我是无法专心致志地推导笔记的时候，我决定静下心来写写这个我思考了许久的问题，又或许是写写这个话题，会让我感到平静。 去年的十一假期左右，我让家里寄来了那台 老旧 （其实保存的还是满崭新的）海鸥 DF-2 ETM，买了几卷胶卷后开始了我或许还不能称之为摄影的游戏之旅。其实讲道理，不知是哪个念头先出现的——是我想去拍照，还是心理健康课程后排那个女生在空间里发了照片让我觉得这或许是接近她的好方法，我就这样开始了这个比较费钱但是可以给我带来很大思考的旅途。事情进行到现在，上次和那个女孩说话还是在去年（而且我在现实中都不敢打招呼，是线上尴尬的邀约出来拍胶卷，也是糊涂，女孩子在意的应该是拍出来有多好看，而不是过程吧，起码同一个根本不认识而且很普通的我应该是如此，不出意外的，我尴尬的话术没有成功，但去年秋天我拍下了人生中第一卷胶卷），而上次按下快门是在昨天。事已至此，我相信上面的问题或许有了另一个角度的回答。 我们为什么要拍照？换句话提问，人类为什么要绘画？古老的墙壁上或许没有文字，但应该是有雕刻拿着火把的火柴人在驱赶野兽。影像的初衷，在我看来是人类刻在 DNA 里炫耀的基因：看看刚刚的瞬间是多么美妙！其次才是记录，这是一个拥有智慧的物种在冷静后的思考：要让我周围和之后的群族明白发生过什么，如何点燃火把，躲避食人的野兽。绘画的历史就是摄影的发展：从单纯的记录，逐渐有了美好的风景，生动的人像，抽象的艺术。可生活的节奏越来越快，工业革命的蒸汽机可以驱动火车，印第安人的马匹却不能昼夜不息；笔刷挥舞地再快，也快不过光穿过小孔，照射在银盐颗粒上瞬间的凝固；调配药水冲洗胶卷的老师傅手法虽纯熟，可按下快门直接在 LCD 屏幕上看到自己美丽动人身姿的模特更加欢欣鼓舞。时间总是一秒一秒流淌，是我们的节奏变快了，行驶的火车窗外有秀丽山河，可一闪而过的一群白点，或许是牧民的羊群在一口一口、一下一下地啃食还有露珠没来的及从草尖滑落的嫩绿。有所失必有所得，有所得必有所失。 数码失掉的是一种不确定性，可能魅力在于我们总是追求可控范围内的刺激。测不准原理告诉我们无法同时得到一个粒子的位置和动量，就像胶卷还躺在旁轴相机里，我却忘记了上次拍照到底有没有摘镜头盖，要不要退回去几张重拍。拍出来的绝对不是你所见到的！甚至，你见到的都不一定是别人见到的。人对于色彩的感应来自于眼睛中视锥细胞，胶卷来自于感光层，数码来自于 CMOS 输出的 0 和 1。数字是精确的，可银盐的分布却只是在区间内准确的，再配上药水的浓度，显影定影的时间长短，还有玄乎的 “手法” ，同样的三要素拍同样的内容，结果可能都会不一样。当然，也可能像我一样，拍很有可能的女生时，Ps 机镜头被挡住了，满怀期待冲洗扫描后，发现怎么就只露出一只手呢？所见即所得，不完全适用于胶卷摄影。 数码对我的吸引也很大，我时常纠结到底应该带数码机还是胶片机，小巧轻便，即时查看，都是胶片无法做到的。可我担心的是即时查看又是否会带来麻木，少了看着取景器中画面的反复思考、按下快门那一瞬间的笃定而担心、湿漉漉的胶卷被擦拭后挂起晾晒的期待。但富士的外观设计，直出的胶片模拟，加上镜头也比一块砖一样的机械单反的机身轻巧一倍，拍完之后手机直接传输，发一条新鲜出炉的朋友圈和动态。这都是胶片不可及的。 或许数码和胶卷本来就是互不干涉的。高速摄影的迅猛，大画幅的“底大一级压死人”，从来都是文无第一武无第二，正如《逃学威龙》中，“两颗弹，三十年从未参战” 的那把善良之枪，摄影从来都不能避开人这个最主要的因素。罗伯特 卡帕的诺曼底登陆并未合焦，依旧是经典，正因为其中有人的参与，并且回归到了记录的本质；薇薇安 迈尔也只是个保姆，她的作品更是没有什么宏大场面，黑白底片也屏蔽了可能蕴含的绚丽色彩，但因为有着人的味道，方能在平淡之中显示珍贵。风光、人像、体育、动物……无论什么样的题材之所以精彩，其实都是因为人，或许说是活物的参与，无论是画面中、取景器后、相纸前，归根结底，摄影是人情味的体现。 那么为什么要拍照？我想到了不同的答案。婴儿总是贪恋母亲的乳汁，学生想要更好的分数，成年人谁不想赚的盆满钵满，老人又怎么不希望儿孙满满福气多多？每个生命都是自私的，想把自己认为最好的据为己有。不要相信 “出世”，和尚想参悟佛法，道士想得道参悟，什么都不管什么都不顾的 “gai溜子” 也是图着彻彻底底的清闲。拍出一张好的照片的欲望，像飞翔的荷兰人号船长戴维 琼斯一般，将美丽的黑珍珠号缩小于自己的收藏瓶之中，哪怕她原本可以在海洋中乘风破浪；看到印象深刻的事物，按下快门便有了将其定格在这一瞬间的能力，再向他人炫耀人定胜天，我将这美妙的一瞬捕捉在我 64GB 大小的储存卡中。而最美的风景和人从不存在于一刻之中，他们流淌在一条名为时间的河，所以我们会不断地拍下去，好似看到魔戒的咕噜，咔嚓声便是那阴森的 “My Precious！” 起码我就是这样。去年开始我偶有不适且较为频繁，我在想或许我可以在学业之外干些什么。摄影像是我的原始冲动，我不善与他人过多交往，却意外地发现周遭的一切非人参杂的环境竟与我相处的如此融洽和谐。于是我想记录下来一些东西，通过我的视角和情感，在这个应该是我人生中自由却有限制、成熟却又幼稚、稳重却充满浮躁的时光开始。文字太过于乏味，视频又过于冗长，一帧一帧的方式再合适不过了。如果运气好，那就拍到坟墓之中，记录我的身体坠入海底，我的灵魂浮上水面。","categories":[],"tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://clicliff.github.io/tags/%E6%9D%82%E8%B0%88/"}]},{"title":"Markdown 使用笔记","slug":"Markdown-使用笔记","date":"2022-08-31T12:03:39.000Z","updated":"2023-01-02T10:13:32.337Z","comments":true,"path":"2022/08/31/Markdown-使用笔记/","link":"","permalink":"http://clicliff.github.io/2022/08/31/Markdown-%E4%BD%BF%E7%94%A8%E7%AC%94%E8%AE%B0/","excerpt":"","text":"2022.8.31Markdown 段落格式标题n 个 # + (空格) &#x3D; n级标题 n &#x3D; 1~6 , Markdown中最多可以表示 6 级标题 字体_ 斜体字 _ (或者是*斜体字*)： 斜体字 ** 粗体字 ** (*同样可以用_来替代，数量一致就行)： 粗体字 但是个人还是喜欢将 * 和 _ 分开，因为会遇到接下来的这位仁兄： _** 又斜又粗字体 **_ （当然也是可以互换符号位置，或者是连用三个相同符号）： 又斜又粗字体 **我收回上面的话，还是只用 * 吧，不然切换输入法好烦。。。 ** 分割线*** 可以是分割线 --- 也可以是分割线 如果正在写的东西让你足够暴躁，当然可以多打大于 3 个的 * 和 - ,否则还是省点力气吧，节约一下胃里还没被消化的食物。 删除线 and 下划线~~ 删除线 ~~: 删除线 &lt;u&gt; 下划线 &lt;/u&gt;: 下划线 加入 假如你是个想要吸引别人注意的 错别字大王，那么这招有用。 注脚注脚： [^ 要注明的文本] 注脚的内容： [^要注明的文本]： 巴拉巴拉巴拉 例如： 注脚在右上角^鼠标移到这里查看内容 注脚的内容一般放在文章的最后，不然让别人第二行就可以看到的东西为什么要多此一举打个注脚？此外我个人认为注脚的用法其实可以这样。^惊喜 Markdown 列表无序列表 * + (空格) 可以 + + (空格)也可以 - + (空格)还可以 有序列表 数字 + . + (空格) 回车后自动会续上下一个序号的列表 在 Typora 中如果数字不连续会间隔稍微大一点 比如 2 和 4 之间 列表嵌套 列表嵌套可以在母列表完成后换行 然后回车掉前面的数字（在Typora中可以这样） 也可以在子列表的列表种类（有序和无序都可以）前添加两个或四个空格 就可以嵌套了 Markdown 区块引用区块&gt; + （空格） + 内容 而且此行之前没有其他内容 就是引用块了，斜体、粗体、_**又粗又 黑 斜而且有 删除线 和下划线的内容都可以用在其中。 **_ 如果要引用一大段诗句，则每行都要加 &gt; 符号，在每行结束之后增加 两个空格 在换行可以使得每行缩进相同。 脑海 诗｜芋头 一个坏念头 和一个好念头 撞在了一起 一个噩梦 后面跟着一个美梦 和一群梦话 一个记忆 想起来的时候是岛 想不起来的时候 是茫茫的海水 区块的嵌套每层增加一个 &gt; 就可以逐层嵌套区块 真是一个 把一句话说得稀碎 的好方法 当然在区块里也可以使用列表 真是一个 把一句话说得更加稀碎 的好方法 列表中也可以使用区块 比如 这样 Markdown 链接一般链接[链接名称](链接地址) 或者是 &lt;链接地址&gt; 如：百度的链接是 百度一下 ​ https://www.baidu.com 需要注意的是括号是中文还是英文，只有英文括号才行。 高级链接如果链接要出现多次，则可以用一个变量来赋值一个链接，再将链接放在文章最后 如： 链接(Baidu)用 1 作为网址变量： [Baidu][1]链接(Bing)用 2 作为网址变量： [Bing][2] 在文章末尾进行赋值 [1]: https://www.baidu.com [2]: https://www.bing.com Baidu Bing 图片图片也是一种链接！是不是很惊喜！所以要在 [ ] 之前加一个 ！ ![图片名称](图片链接”图片名称”) ！看得我也好想睡觉！可恶！ 当然，图片也可以使用高级链接 Markdown 表格可以使用 | 来分割不同的单元格，表头可以用 - 来分隔 | 表头 | 表头 | | —- | —- | | 单元格 | 单元格 | |单元格 | 单元格 | 表头 表头 单元格 单元格 单元格 单元格 内容和标题栏的对齐方式，也通过对分隔行添加 ： 可以也可以设置 右对齐： -: 左对齐： :- 居中： :-: 其他代码 在 markdown 中写代码也未尝不是一种方式，虽然没有在编译器里写那么舒服 代码（当然也可以是函数）的片段可以用反引号 ‘ &#96; ‘ 来包起来 譬如： `print()` 在 python 中是打印的意思 ​ print() 在 python 中是打印的意思 与编译器中相同，Tab 键也表示四个空格，代码区块可以用 Tab 来分隔 此外，可以用 &#39; &#96;&#96;&#96; &#39; 来包裹一段代码，指定语言（也可以不指定） ```Python for i in range(10): ​ print(‘Hello World’) 123for i in range(10): print(&#x27;Hello World&#x27;) 转义在 Markdown 中，在 ‘ \\ ‘ 之后的字符可以正常显示，不会体现特殊意义，’ * ‘ 等字符都可以使用 公式Markdown 中使用 Tex 来渲染数学表达式，Typora 中也可以选择使用 LaTax ，分隔符有两种可以选择： $ … $ 与 *\\( … )\\* 中的公式将在行内显示 $$ … $$ 与 *\\[ … ]\\* 以及 `&#96;&#96;math 中的公式将在块内显示 $ f(x) &#x3D; sin(x) $ f(x) = sin(x) 最后对我来说 Markdown 的使用要远远简单于 Word ，可能是因为 Word 功能太强大了吧。我惊叹于 Markdown 的简洁和易于上手，毫无疑问这是做笔记，写一些感兴趣东西的利器，当然，Typora 也非常好用，不枉我购买了这个软件，此外这也应该是我上传到第一篇正式的 Blog （在拖延了整一个月之后）。两个月的假期太久了，接下来要行动起来了，像上学期一样。","categories":[],"tags":[{"name":"笔记","slug":"笔记","permalink":"http://clicliff.github.io/tags/%E7%AC%94%E8%AE%B0/"}]},{"title":"简介","slug":"简介","date":"2022-07-31T03:41:26.000Z","updated":"2022-11-25T14:33:45.778Z","comments":true,"path":"2022/07/31/简介/","link":"","permalink":"http://clicliff.github.io/2022/07/31/%E7%AE%80%E4%BB%8B/","excerpt":"","text":"突发奇想要建立一个自己的网站 于是花费小半天（我比较愚钝）利用 Hexo 来搭建，十分感叹居然有如此简洁便利的方式，就像在互联网里有了一个窝（😂） 关于内容，则没有进行太多的预期，或许可以上传之前的一些课程笔记（数理方法，分析力学，电动力学）以及之后的一些学习内容，也可以锻炼一下LeTax的排版以及md文件的使用等。 此外，肯定会有我的一些随想（或许是天马行空的梦，也可能是乏味的牢骚，当然我还想记录我与外婆的一些谈话里的故事），我想将自己开始接触摄影将近一年的比较喜欢的 ”作品“ （引号是因为目前还谈不上是作品）上传，也想将看电影的影评，喜欢的音乐（也可能是我自己录的一些音频）上传。 大学的两年，自觉各方面都有所进步。可人生之路漫漫，我总是面对着这样那样的谜团，希望我会随着时间的流逝逐一解开谜底，像是与镜子中的自己来一场推手，并无胜负之分，却希望有一台摄像机记录两个一模一样的人互相拆招的过程，注定笨拙、有趣。 小时候一人分饰几角来进行多人游戏——飞行棋、大富翁、斗地主。马上12点了，我想开始这场自己与自己有趣的游戏。","categories":[],"tags":[{"name":"杂谈","slug":"杂谈","permalink":"http://clicliff.github.io/tags/%E6%9D%82%E8%B0%88/"}]}],"categories":[],"tags":[{"name":"夜谈","slug":"夜谈","permalink":"http://clicliff.github.io/tags/%E5%A4%9C%E8%B0%88/"},{"name":"杂谈","slug":"杂谈","permalink":"http://clicliff.github.io/tags/%E6%9D%82%E8%B0%88/"},{"name":"笔记","slug":"笔记","permalink":"http://clicliff.github.io/tags/%E7%AC%94%E8%AE%B0/"}]}